# DockablePaneState Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DockablePaneState Properties
DockablePaneState Class See Also
---
The DockablePaneState type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DockPosition | Which part of the Revit application frame the pane should dock to. |
| FloatingRectangle | When %dockPosition% is Floating, this rectangle determines the size and position of the pane. Coordinates are relative to the upper-left-hand corner of the main Revit window. Note: the returned Rectangle is a copy. In order to change the pane state, you must call SetFloatingRectangle with a modified rectangle. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| MinimumHeight | When %dockPosition% is anything other than floating, the minimum height to use for the pane. Default is 200 pixels. |
| MinimumWidth | When %dockPosition% is anything other than floating, the minimum width to use for the pane. Default is 200 pixels. |
| TabBehind | Ignored unless %dockPosition% is Tabbed. The new pane will appear in a tab behind the specified existing pane ID. |

# See Also
DockablePaneState Class
Autodesk.Revit.UI Namespace